{
    "titre":"Codeurs En Seine",
    "programme":{
        "jours":[
            {
                "title": "day1",
                "date": "17/10/2013",
                "tracks":[
                  {
                        "type":"general",
                        "talks":[
                            {"id":1 , "time":"8:50", "format":"keynote", "url":"", "title":"Keynote d'ouverture", "description":"Accueil - Présentation du Programme - Keynote", "room":""}
                        ]
                    },
                     
                    {
                        "type":"web",
                        "talks":[
                            {"id":10 , "time":"10:25", "format":"conference", "url":"", "title":"Penser le persuavive Design", "room":"", "description":"Une intervention de 20 min pour présenter la théorie de l'engagement, la manière de l'intégrer dans les processus de conception d'interfaces, et son ROI."},
                            {"id":11 , "time":"11:25", "format":"conference", "url":"", "title":"Les performances web", "description":"La performance, c'est le tueur invisible de la qualité du site. Accélérer un site doit faire aujourd'hui partie des compétences de base des développeurs web, pourtant des nouvelles techniques et stratégies sortent tous les jours.<br />Tirée de l'expérience, d'une formation pro et d'années de veille, nous allons voir en une heure les techniques incontournables ainsi que les outils et les process à mettre en place pour améliorer et maintenir la qualité de ses pages.","room":""},             
                            {"id":12 , "time":"12:25", "format":"conference", "url":"", "title":"JS natif", "description":"Les améliorations des navigateurs pour l'interprétation du JavaScript et les besoins de réduire le poids des pages rendent l'utilisation de librairies comme jQuery ou Mootools bien inutile. Passer par du JS natif permet de coder de manière plus fine et plus lègère.", "room":""}              
                        ]
                    },
                    {
                        "type":"buffet",    
                        "talks":[
                            {"id":2 , "time":"13:15", "format":"break", "url":"", "title":"Buffet", "description":"", "room":""}
                        ]
                    },

                    {
                        "type":"web",
                        "talks":[               
                            {"id":13 , "time":"14:15", "format":"conference", "url":"", "title":"As-tu vu mon site ?", "description":"Améliorer le placement de son site est un besoin essentiel pour valoriser ses contenus. S'il existe des techniques éprouvées pour l'amélioration de son trafic ; une stratégie de référencement ne s'improvise pas, elle demande une définition précise de ses objectifs et un suivi assidu de son positionnement", "room":""},    
                            {"id":14 , "time":"15:15", "format":"conference", "url":"", "title":"Horizons de l'accessibilité","description":"De loin, l'accessibilité, c'est bien pour les personnes présentant des handicaps. Mais à y regarder de plus près, on y perçoit une véritable attention portée sur la construction de son code. Véritable discipline transversale aux métier du web ; l'accessibilité est un vecteur d'amélioration globale de la qualité.", "room":""},                  
                            {"id":15 , "time":"16:15", "format":"conference", "url":"", "title":"Table ronde sur la qualité web","description":"Discussion animée à propos de la manière de promouvoir la qualité web dans ses projets", "room":""}                  
                        ]
                    },
                    {
                        "type":"agile",
                        "talks":[
                            {"id":30 , "time":"10:25", "format":"conference", "url":"", "title":"Software craftmanship", "description" : "Quelque part au coeur du processus de création d'un projet, existe des gens qui lisent, écrivent et se bagarrent avec du code. Ces gens, appelés \"programmeurs\", ont une culture directement issue de cette bataille entre l'homme et la machine.<br/> Qu'est-ce qui les frustre, les exalte, les freine ? <br/>Quels sont les biais cognitifs avec lesquels ils travaillent ? Quel est l'environnement et les processus qui permettent qu'ils donnent le meilleur d'eux même ?<br/><br/> Comprendre cette culture est un facteur clé de réussite d'un projet à court terme et d'une entreprise à moyen terme.<br/><br/> Dans cette session nous allons explorer la culture de ceux qui programment efficacement afin que vous puissiez adapter environnement, processus et organisation pour transformer vos programmeurs lambdas en véritables craftmen.", "room":""},
                            {"id":31 , "time":"11:25", "format":"conference", "url":"", "title":"Lean startup", "room":""},             
                            {"id":32 , "time":"12:25", "format":"conference", "url":"", "title":"Continuous delivery chez capitainetrain.com", "room":""},                  
                            {"id":33 , "time":"14:15", "format":"conference", "url":"", "title":"Live coding ", "room":""},                  
                            {"id":34 , "time":"15:15", "format":"conference", "url":"", "title":"Real options", "room":"", "description":"L'analyse par les Options Réelles est une technique qui permet de prendre des décisions sur les décisions. C'est cool, c'est meta.<br/>Mais quel est l'intéret pour l'équipe au quotidien ?<br />Vous prenez plein de décisions chaque jour comme développeur ou architecte. Des décisions qui peuvent couter cher.<br/>Les Options Réelles ne sont pas très compliquées, cela s'explique en quelques minutes. Mais en appliquant les Options Réelles sur les projets informatiques et sur l'architecture des logiciels j'ai découvert que plein de choses que je croyais vraies ou qui me semblaient intuitivement correctes étaient fausses.<br />J'illustre chaque technique avec des exemples qui viennent de projets auxquels j'ai participé les dernières années, ou bien de la vie de tous les jours.<br/>Découvrez une autre façon de voir les décisions, des techniques simples pour gérer des projets ou définir une architecture de logiciel. Vous découvrirez peut-être que vous aussi croyez des choses qui sont fausses.<br/>Au minimum vous entendrez quelques histoires belges... :-)"},                  
                            {"id":35 , "time":"16:15", "format":"conference", "url":"", "title":"Live coding Test Javascript", "description": "Dans ce live coding d'environ 30 minutes vous verrez comment combiner l'écriture de tests expressifs avec une application utilisant les technologies web derniers cris.<br/><br/>Cette démonstration est une application directe des principes du livre Growning Object Oriented Software Guided By Test, vous y trouverez BDD, TDD, HTML5, Java & JavaScript. Son application est particulièrement adaptée à des applications utilisant un front-end Javascript + Css et à destination des développeurs comme des analystes.<br/><br/>La démonstration portera principalement sur la combinaison explosive de deux outils Cucumber & Zombie, pour des tests d'acceptantes en langage naturel et une vitesse d'exécution imbattable. Ces techniques sont utilisables avec d'autres outils nous l'évoquerons dans la partie de la présentation qui est dédiée à l'échange avec le public pour discuter des avantages et des limites de cette approche.<br/><br/>L'occasion idéale de réconcilier BDD avec faisabilité, rapidité et innovation. Le code source de la démonstration, ainsi que quelques instructions sera mis à disposition.","room":""}
                        ]
                    },
                    {
                        "type":"java",
                        "talks":[
                            {"id":50 , "time":"10:25", "format":"conference", "url":"", "title":"MongoDB", "room":""},
                            {"id":51 , "time":"11:25", "format":"conference", "url":"", "title":"Programmation parallèle", "room":""},             
                            {"id":52 , "time":"12:25", "format":"conference", "url":"", "title":"JEE7", "room":""},                  
                            {"id":53 , "time":"14:15", "format":"conference", "url":"", "title":"TP JEE7(1/2)", "room":""},
                            {"id":54 , "time":"14:15", "format":"conference", "url":"", "title":"Cloud - Le cloud dans la vraie vie", "room":"", "description":"Depuis quelques temps le Cloud Computing s’affiche partout, de la une des magazines informatiques jusqu’aux spots de publicité à la télévision. Mais le Cloud Computing est-il juste un mot à la mode ou peut-il vous aider à développer votre application ? Je vous présenterai plusieurs offres Cloud en m'appuyant sur des cas clients très concrets. Nous regarderons aussi comment nos architectures ont du évoluer pour utiliser au mieux des services comme Amazon Web Service ou Google App Engine."},    
                            {"id":55 , "time":"14:15", "format":"conference", "url":"", "title":"Dev ops", "room":""},                   
                            {"id":56 , "time":"15:15", "format":"conference", "url":"", "title":"TP JEE7(2/2)", "room":""},   
                            {"id":57 , "time":"15:15", "format":"conference", "url":"", "title":"Cloud - Monitoring & Management", "room":""},  
                            {"id":58 , "time":"15:15", "format":"conference", "url":"", "title":"Javascript pour les javaistes", "room":"", "description":"Votre chef a décidé que vous allez développer la partie présentation de votre application en utilisant le dernier framework JavaScript à la mode. Comme vous connaissez Java cela devrait bien se passer. <br/>De votre côté, vous cauchemardez encore en repensant à vos nuits de debuggage à grand coup d’alert.<br/>Au cours de cette présentation, je vous propose d’abord un tour du langage JavaScript en comparaison à Java. Quelles sont les différences ? Quels sont les pièges ? Qu’est ce qui est bien voir mieux qu’en Java ?<br />Ensuite nous verrons comment vous allez pouvoir intégrer tout ce JavaScript dans votre intégration continue et métriques de code pour faire un travail de qualité comme vous en avez l’habitude en Java."},                  
                            {"id":59 , "time":"16:15", "format":"conference", "url":"", "title":"Groovy", "room":""},
                            {"id":60 , "time":"16:15", "format":"conference", "url":"", "title":"Cloud - Architecture Pattern", "room":"", "description":"Les \"Platform as a Service\" nous promettent une migration sans douleur des applications dans le Cloud, mais les choses ne sont pas si simple et votre appli legacy à base d'EJB 1.0 ne passera pas l'étape du Cloud sans un sérieux refactoring.<br/>Pendant cette session, je vais expliquer quelques patterns d'architecture à application à vos développements, et les refacroring ou services qui pourront vous aider à migrer vos applications sans dommages, pour une transition vers le Cloud en douceur. <br/>Pour éviter de la pure théorie, je partagerais l'expérience des applications de Devoxx, migrées d'un hébergement sur hardware dédié vers CloudBees."},
                            {"id":61 , "time":"16:15", "format":"conference", "url":"", "title":"Android, passons au niveau supérieur", "room":"", "description":"Tentons ensemble une expérience folle, prenons la place de l'utilisateur ! Cette présentation vous permettra de mesurer les frustrations que nos chers users peuvent endurer, afin d'en déduire des guidelines qui nous permettrons, en tant que développeur, de leur rendre la vie meilleure."}               

                         ]
                    }
                ]
            }
        ]
    }
}

