[
    {
        "id": 1,
        "fullname": "Pierre Pezziardi",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-pezziardi.jpg",
        "description": "Entrepreneur, co­fondateur du cabinet de conseil OCTO Technology, co­fondateur de l’Université du SI, fondateur d’OpenCBS Microfinance, créateur de NotreBanque, auteur, conférencier, il promeut l’idée d’Informatique Conviviale : des systèmes destinés à décloisonner les organisations et à rendre leur autonomie aux équipes.",
        "liens": [],
        "type": "Keynote",
        "talks": [ {"id":"1"}]
    },
    
    {
        "id": 101,
        "fullname": "Laurent Demontiers",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-demontiers.jpg",
        "description": "Web Consultant-AMOA-UX / Startuper / Teacher / Speaker / Organisateur des Rencontres Interactives de Caen / Dans l'écosystème web depuis 1997.",
        "liens": [{
					"url": "http://demontiers.com",
					"label": "Blog"
					},
					{
          "url": "http://twitter.com/L_Demontiers",
          "label": "Twitter"
          }],
        "type": "Web",
        "talks": [ {"id":"10"}]
    },
    {
        "id": 102,
        "fullname": "Matthias Dugué",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-mads.jpg",
        "description": "Consultant/Développeur aujourd'hui chez Clever Age, il parcourt la toile sans relâche, à la recherche de l'élixir de qualité, de la pierre d'innovation, et de la poudre d'accessibilité. D'un optimisme sans faille, il poursuit inlassablement sa quête au côté d'autres valeureux compagnons, pour libérer le web de ses démons…",
        "liens": [
				{
        "url": "http://twitter.com/madsgraphics",
        "label": "Twitter"
        }],
        "type": "Web",
        "talks": [ {"id":"12"}]
    },
    {
        "id": 103,
        "fullname": "Jean-Pierre Vincent",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-jean-pierre-vincent.jpg",
        "description": "Expert en application Web et maître accélérateur de pages. Codeur frontend depuis 2000, Jean-pierre est maintenant freelance pour aider son prochain à dompter les navigateurs, et fournir des sites de qualité aux utilisateurs. Ses armes sont la formation, le conseil et oui encore un peu de code front ! 'La performance, c'est le tueur invisible de la qualité.'",
        "liens": [
				{
				"url": "http://braincracking.org",
				"label": "Blog"
				},
				{
        "url": "http://twitter.com/jpierrevincent",
        "label": "Twitter"
        }],
        "type": "Web",
        "talks": [ {"id":"11"}]
    },
    {
        "id": 104,
        "fullname": "Julien Brousse",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-julienbrousse.jpg",
        "description": "Gestion de projet web, SEM, SEO, display, affiliation, SMO, il a tout testé ! Il se considère comme un généraliste de l’acquisition de trafic après mon passage chez Oscaro.com et par l’agence de référencement Blog-Ecommerce. Aujourd’hui, il conseille les petits E-commerçants pour les aider à lancer leur boutique en passant notamment par le développement de leur visibilité sur les moteurs de recherche et c’est du sport !",
        "liens": [],
        "type": "Web",
        "talks": [ {"id":"13"}]
    },
    {
        "id": 105,
        "fullname": "Jonathan Pansiot",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-jonathan-pansiot.jpg",
        "description": "Intégrateur spécialisé en accessibilité chez Alter Way. Il mène les audits et valide les exigences en matière d’accessibilité. Jonathan se spécialise particulièrement dans les réflexions sur la mise en place au sein des cycles de productions des exigences qualité et accessibilité, ainsi que dans la conception des interfaces riches avec Wai-Aria.",
        "liens": [{
        "url": "http://twitter.com/uxlco",
        "label": "Twitter"
        }],
        "type": "Web",
        "talks": [ {"id":"14"}]
    },
		{
        "id": 106,
        "fullname": "Delphine Malassingne ",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-delphine-malassingne.jpg",
        "description": "De formation initiale artistique, je me suis très vite intéressée au web. J'ai eu la chance d'être rapidement formée aux standards du web, à l'accessibilité, aux problématiques du web de qualité. Mon parcours a donc toujours suivi ces objectifs et c'est ainsi que je suis devenue responsable qualité web.",
        "liens": [
				{
				"url": "http://nissone.com/",
				"label": "Blog"
				},
				{
        "url": "http://twitter.com/Nissone",
        "label": "Twitter"
        }],
        "type": "Web",
        "talks": [ {"id":"15"}]
    },

    {
        "id": 201,
        "fullname": "David Gageot",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-gageot.jpeg",
        "description": "développeur indépendant. Sa passion ? L'écriture de logiciels pointus mais simples. Il a pour leitmotiv d'être un facilitateur qui, par sa créativité et son expertise, aide les équipes à être plus innovantes et plus efficaces. Depuis 2010, il a pris le leadership sur le projet open-source Infinitest : un plugin pour Eclipse et IntelliJ qui permet, après chaque changement de code, de jouer les tests unitaires potentiellement impactés.",
       "liens": [{
"url": "http://code-story.net/",
"label": "CodeStory"
},
{
"url": "http://www.twitter.com/dgageot",
"label": "Twitter"
}],
        "type": "Agile",
        "talks": [ {"id":"33"}]
    },
    {
        "id": 202,
        "fullname": "Frédéric Menou",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-menou.jpeg",
        "description": "Développeur Java et désormais développeur Ruby chez Capitaine Train, également 'formateur git', Frédéric accompagne les développeurs sur le chemin du Clean Code. Il est également Bagger sur la région parisienne (brownbaglunch.fr).",
       "liens": [],
        "type": "Agile",
         "talks": [ {"id":"32"}]
    },
    {
        "id": 203,
        "fullname": "Jean Laurent de Morlhon",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-morlhon.png",
        "description": "CTO @ Serpodile, Mr FooBarQix @ CodeStory, adore développer simplement & intelligemment avec des développeurs passionnés. Fidèle défenseur du développeur, explore le mouvement Software Craftsmanship.",
       "liens": [{
"url": "http://code-story.net",
"label": "CodeStory"
},
{
"url": "http://serpodile.com",
"label": "Serpodile"
}],
        "type": "Agile",
        "talks": [ {"id":"30"},{"id":"35"}]
    },
    {
        "id": 204,
        "fullname": "Pascal Van Cauwenberghe",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-pascalV.png",
        "description": "Pascal Van Cauwenberghe est un consultant basé à Bruxelles qui essaie de résoudre plus de problèmes qu’il n’en crée. Pour cela il utilise des méthodes issues de l’agile, du Lean, de la théorie des contraintes, du Systems Thinking notamment. Il est un des fondateurs du groupe XP en Belgique et un des organisateurs des XP Days Benelux. Un jour, Vera Peeters et lui ont inventé le “XP Game“, parce qu’ils ne réussissaient pas à expliquer XP. Ils ont appris que le jeu est un moyen idéal pour apprendre.",
       "liens": [{
"url": "http://blog.nayima.be",
"label": "Blog"
},
{
"url": "http://www.twitter.com/pascalvc",
"label": "Twitter"
},
{
"url": "http://be.linkedin.com/in/pascalvancauwenberghe/",
"label": "Linkedin"
}],
        "type": "Agile",
        "talks": [ {"id":"34"}]

    },
    {
        "id": 205,
        "fullname": "Matthieu Garde-Lebreton",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-mgarde.jpg",
        "description": "Entrepreneur à temps plein et pratiquant Lean convaincu, passionné par l’innovation et investi dans la création de Startups depuis l'école. Il apprend continuellement par la pratique, la rencontre d'autres entrepreneurs, et la lecture. Fondateur de Lean Startup France, un cabinet de conseil qui aide les entrepreneurs à bâtir une Startup à partir de leur vision et de leurs idées, grâce à la philosophie Lean Startup et les techniques de Customer Development. En parallèle, Matthieu teste en permanence de nouvelles idées. Également ingénieur logiciel spécialisé dans la technologie Microsoft .NET.",
       "liens": [{
"url": "http://matthieugarde.com/",
"label": "Blog"
},
{
"url": "http://www.twitter.com/MatthieuGarde",
"label": "Twitter"
},
{
"url": "http://www.meetup.com/Lean-Startup-User-Group/",
"label": "Lean Startup User Group"
}],
        "type": "Agile",
        "talks": [ {"id":"31"}]
    },

    {
        "id": 301,
        "fullname": "Antonio Goncalves",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-goncalves.jpg",
        "description": "Antonio is a senior developer specialized in Java/Java EE. As a consultant he advises customers and helps them in defining and developing their software architecture. <br/>This Java Champion is also the founder of the very successful Paris JUG, Devoxx France and an independent JCP member on various JSRs (Java EE 6, Java EE 7, EJB 3.2).<br/>Based on his Java EE experiences, he has written three books covering Java EE 5, Java EE6 and recently Java EE 7 with Glassfish 4.",
       "liens": [],
        "type": "Java"
        ,
        "talks": [ {"id":"52"},{"id":"53"}]
    },
    {
        "id": 302,
        "fullname": "José Paumard",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-paumard.jpg",
        "description": "Maître de conférences à l'institut Galilée (université Paris 13) et docteur en mathématiques appliquées de l'ENS de Cachan. Il découvre Java en 1995, et enseigne le langage et ses API depuis 2000 en DESS (devenu M2 depuis). Il y a 10 ans, José rencontre Pierre Briant et se passionne depuis pour les bases de données historiques et archéologiques. Il codirige dans ce cadre le projet MAVI en collaboration avec le collège de France, et publie en open source Open melodie plateforme Java qui joue le rôle de back-office du MAVI. Il tient le blog Java le soir.",
       "liens": [
                {
                "url": "http://blog.paumard.org/",
                "label": "Blog"
                }],
        "type": "Java",
        "talks": [ {"id":"51"}]
    },
    {
        "id": 303,
        "fullname": "Nicolas De Loof",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-deloof.png",
        "description": "Senior Engineer chez CloudBees, après avoir été Architecte Java pour de grandes SSII françaises. Techno-veilleur et développeur open-source, il a rejoint l’équipe de développement Maven en 2007, en particulier pour le support de GWT. Avec 15 ans d’expérience en développement dans ses bagages et de nombreuses relations dans la communauté Java, il anime depuis 2008 le BreizhJUG, groupe d’utilisateur Java Rennais. Il a participé à plusieurs conférences sur le thème de la forge logicielle et contribue activement au microcosme Java.",
       "liens": [{
            "url": "http://blog.loof.fr",
            "label": "Blog"
            },
            {
            "url": "http://www.twitter.com/ndeloof",
            "label": "Twitter"
            },
            {
            "url": "http://www.cloudbees.com",
            "label": "Cloudbees"
            }],
        "type": "Java",
        "talks": [ {"id":"60"}]

    },
    {
        "id": 304,
        "fullname": "Samuel Liard",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-liard.png",
        "description": "Fondateur de la société Apptom, il met en avant son expertise sur la conception et le développement de services web en accompagnant les entreprises à migrer vers des offres de cloud computing (IAAS ou PAAS en fonction du besoin). Architecte Logiciel chez Orange Labs à Lannion pendant 8 ans, Samuel Liard a 13 ans d'expérience dans le développement et plus spécifiquement dans le monde JEE. En 2011 il a créé l'association Code d'Armor qui anime des soirées techniques une fois par mois. Toujours dans ce cadre il coorganise en 2012 la seconde édition du Startup Week-end Bretagne à Lannion.",
        "liens": [
            {
            "url": "http://www.twitter.com/sliard",
            "label": "Twitter"
            },
            {
            "url": "http://www.linkedin.com/in/samuelliard",
            "label": "linkedIn"
            }],
        "type": "Java",
        "talks": [ {"id":"54"}]
    },
    {
        "id": 305,
        "fullname": "Alexis Moussine-Pouchkine",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-amp.png",
        "description": "Vétéran de Sun Microsystems, désormais la tête dans le cloud dans son rôle de responsable des relations développeurs chez Google en France.",
       "liens": [],
        "type": "Java",
        "talks": [ {"id":"57"}]
    },
    {
        "id": 306,
        "fullname": "Guillaume Laforge",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-glaforge.jpg",
        "description": "Guillaume is the project lead of Groovy, the highly popular and successful dynamic language for the JVM. He co-authored Manning's best seller 'Groovy in Action' with Dierk König, and is working for SpringSource (a division of VMWare) where he's hacking full time on cool and Groovy stuff. You can meet Guillaume at conferences around the world where he evangelizes the Groovy dynamic language, Domain-Specific Languages in Groovy, the agile Grails web framework or the Gaelyk lightweight toolkit for Google App Engine.",
       "liens": [],
        "type": "Java",
        "talks": [ {"id":"59"}]
    },
    {
        "id": 307,
        "fullname": "Eyal Lezmy",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-elezmy.jpg",
        "description": "Software Engineer chez <a href=\"http://www.genymobile.com\">GenyMobile</a>, trésorier du Paris Android User Group et Google Developer Expert sur Android. Il a débuté Android en 2009. Après différents projets R&D chez les opérateurs, il travaille actuellement chez un grand constructeur mobile coréen où il se dédie à des sujets Android tournés vers l'entreprise.",
       "liens": [ 
       {
            "url":"http://paug.fr",
            "label":"Blog"
       },
       {
            "url":"http://twitter.com/Eyal_Lezmy",
            "label":"Twitter"
       },
       {
            "url":"https://plus.google.com/u/0/109290164663410811176/posts",
            "label":"Google+"
       },
       {
           "url":"http://www.genymobile.com",
           "label":"GenyMobile"
       }
       ],
        "type": "Java",
        "talks": [ {"id":"61"}]
    },
    {
        "id": 308,
        "fullname": "Christophe Jollivet",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-cjollivet.jpg",
        "description": "Leader technique chez Apside, Christophe prêche les bonnes pratiques sur divers projets informatiques et universités en région tourangelle. Reconverti  il y a 10 ans suite à un doctorat de neurobiologie, il contribue activement dans les communautés Java en ayant été co-responsable de la rubrique Java du site developpez.com mais aussi en participant à des conférences et en animant depuis 2008 le Tours JUG.",
        "liens": [
        {
            "url": "http://jollivetc.blogspot.fr",
            "label":"Blog"
       },
       {
            "url":"https://twitter.com/jollivetc",
            "label":"Twitter"
       },
       {
            "url":"https://plus.google.com/113717392164007267805/posts",
            "label":"Google+"
       }
       ],
        "type": "Java",
        "talks": [ {"id":"58"}]
    },
    {
        "id": 309,
        "fullname": "Katia Aresti",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-karesti.jpg",
        "description": "Membre de <a href=\"http://www.duchess-france.org/open-space-nosql/\">Duchess France</a>, du <a href=\"http://www.meetup.com/Paris-MongoDB-User-Group/\">MongoDB User Group à Paris</a> et <a href=\"http://www.mongodb.org/\">MongoDB</a> master depuis 2012, travaille depuis 2005 dans l’informatique. D’abord comme consultant Sopra et Xebia, puis comme freelance depuis septembre 2012. Elle travaille principalement autour de la plateforme Java, mais aussi accessoirement sur la plateforme PHP. Elle travaille avec MongoDB depuis 2010, elle a débuté au sein de l’équipe <a href=\"http://www.urbandive.com/\">UrbanDive/Mappy</a>, qui a été l’une des premières à adopter MongoDB en production en France.  Elle intervient sur les sujets autour de Java et MongoDB sous la forme de présentations formelles, open-spaces ou workshops. Elle est passionnée par l’agilité, l’open-source et par contribution communautaire.",
        "liens": [
        {
            "url":"https://twitter.com/karesti",
            "label":"Twitter"
       }
        
        
       ],
        "type": "Java",
        "talks": [ {"id":"50"}]
    },
    {
        "id": 310,
        "fullname": "Bertrand Paquet",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-bpaquet.gif",
        "description": "Bertrand est architecte senior chez Octo Technology. Il intervient chez ses clients dans des missions d'architecture, d'expertise Java / Ruby, aussi bien coté développement que coté production. A ce titre, il travaille sur des sujets liés à l'infrastructure : conception d'architectures de performances, virtualisation, déploiement multi plateformes, tirs de performances, monitoring et supervision...",
        "liens": [
            {
                "url":"https://twitter.com/_bpaquet",
                "label":"Twitter"
            }
        ],
        "type": "Java",
        "talks": [ {"id":"55"}]
    },
    {
        "id": 311,
        "fullname": "Vincent Massol",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-massol.gif",
        "description": "Bertrand est architecte senior chez Octo Technology. Il intervient chez ses clients dans des missions d'architecture, d'expertise Java / Ruby, aussi bien coté développement que coté production. A ce titre, il travaille sur des sujets liés à l'infrastructure : conception d'architectures de performances, virtualisation, déploiement multi plateformes, tirs de performances, monitoring et supervision...",
        "liens": [
            {
                "url":"https://twitter.com/vmassol",
                "label":"Twitter"
            }
        ],
        "type": "Java",
        "talks": [ {"id":"56"}]
    },

    {
        "id": 2,
        "fullname": "Fabrice Croiseaux",
        "avatar": "http://www.codeursenseine.com/assets/img/orateur-fcroiseaux.jpg",
        "description": "Luxembourg, Innovation, Digital Economy, Web Development, Scala, Java, Philosophy, Ideas, Learning. Podcaster @nipdev @niptechpodcast",
        "liens": [
            {
                "url":"http://www.niptech.com/podcast/category/nipdev/",
                "label":"Nip Dev"
            },
            {
                "url":"https://twitter.com/fxzo",
                "label":"Twitter"
            }
        ],
        "type": "Podcast",
        "talks": [ {"id":"3"}]
    }

]
