{
    "titre":"Codeurs En Seine",
    "programme":{
        "jours":[
            {
                "title": "day1",
                "date": "27/10/2014",
                "tracks":[

                    {
                        "type":"web",
                        "talks":[
                            {"id":11,
                            "format":"conference", 
                            "url":"", 
                            "title":"Wow, much web. Very tech.",
                            "description":"En à peine 25 ans, le web est passé de quelques documents textuels liés entre eux à la plate-forme de facto de tous les nouveaux services, usages, et trucs cool en général.  Du terrain de jeu de quelques scientifiques dans leur coin, à la moelle épinière de nos journées, au boulot comme entre amis.\n\nPour prédire l'avenir, il est utile de se pencher sur le passé.  À une époque où la majorité des développeurs web ne codaient pas il y a seulement 10 ans, Christophe joue les dinosaures à la mémoire longue et retrace avec humour et énergie l'ébullition technologique et interactive du web, du CERN à l'Internet des Objets en passant par la galaxie WS-*, l'éclatement de la bulle de 2000, le Web 2.0 et la victoire de JavaScript. Entre autres."
                            }
                         ]
                    },
                    {
                        "type":"web",
                        "talks":[
                            {"id":12,
                            "format":"conference", 
                            "url":"", 
                            "title":"Mon browser, ma VM, mon amour...",
                            "description":"Voilà plusieurs années que le web s'oriente vers une architecture interactive, et plus uniquement consultative. La percée de Firefox OS est la pierre qui marque le virage sur le chemin. Plus que jamais aujourd'hui, il nous faut considérer le navigateur comme une machine virtuelle d'exécution, dans laquelle nos applications peuvent tourner. HTML, ARIA, CSS, JS : tout ce petit monde contribue à fournir les clés dont nous avons besoin pour bâtir les applications du futur.\n\nMais derrière le rêve d'un « tout dans le navigateur » se cachent des pièges traîtres pour les développeurs : mémoire, performance, optimisation, design & dark patterns. Ceux-là aussi, il va falloir les dompter, les apprivoiser, et tirer parti du savoir-faire acquis sur les autres plateformes pour ne pas refaire les mêmes erreurs.\n\nSi on apprenait à faire les applications du futur, maintenant ?"
                            }
                         ]
                    },
                    {
                        "type":"web",
                        "talks":[
                            {"id":13,
                            "format":"conference", 
                            "url":"", 
                            "title":"Le Blues des Préfixes Navigateurs",
                            "description":""
                            }
                         ]
                    },
                    {
                        "type":"web",
                        "talks":[
                            {"id":14,
                            "format":"conference", 
                            "url":"", 
                            "title":"",
                            "description":""
                            }
                         ]
                    },
                    {
                        "type":"web",
                        "talks":[
                            {"id":15,
                            "format":"conference", 
                            "url":"", 
                            "title":"",
                            "description":""
                            }
                         ]
                    },
                    {
                        "type":"web",
                        "talks":[
                            {"id":16,
                            "format":"conference", 
                            "url":"", 
                            "title":"L'avenir où le CSS nous aura tous tué",
                            "description":"Nous sommes en 2034. Plus personne ne fait de ligne de code, il n’y a plus de notion de cloud, PaaS, SaaS, PHP, Ruby, JavaScript, HTML, CSS. Tout fonctionne grâce au Maître que l’on nomme « Le Chauve ». Je suis un résistant de mon époque, je viens dans votre monde vous expliquer comment nous en sommes arrivé là."
                            }
                         ]
                    },
                    {
                        "type":"web",
                        "talks":[
                            {"id":17,
                            "format":"conference", 
                            "url":"", 
                            "title":"Cartographie du web",
                            "description":"Nous naviguons chaque jour à travers le Web, allant de page en page via les liens hypertextes. Mais si le Web est un espace, comment le représenter ? Nous partirons d'une simple page et prendrons du recul, pour en observer les voisins directs, puis cartographier les territoires alentours."
                            }
                         ]
                    },
                    {
                        "type":"agile",
                        "talks":[
                            {"id":30,
                                "format":"conference",
                                "url":"",
                                "title":"Git++ : Passez au niveau supérieur de la gestion de version",
                                "description":"On utilise tous git mais on constate trop souvent qu'il est utilisé comme SVN malheureusement. Git apporte de la valeur dans le quotidien d'un développeur sans forcément ajouter de complexité.\n\nAvec git rebase et un peu de volonté, on peut réussir à avoir un historique expressif qui aidera tous les développeurs à s'y retrouver et il vous permettra même de générer un changelog fonctionnel ! Vous pouvez aussi récupérer des commits d'une branche sur une autre. Et plus encore!\n\nVenez apprendre quelques astuces simples qui vous permettrons d'améliorer votre manière de gérer votre code!"
                            }
                        ]
                    },
                    {
                        "type":"agile",
                        "talks":[
                            {"id":31,
                                "format":"conference",
                                "url":"",
                                "title":"TDD is not dead",
                                "description":"Is TDD Dead ? Le “débat” lancé par un article de DHH l’un des créateurs du framework ruby on rails a fait le tour du web. Cela a déclenché tout un tas de réactions et débats enflammés. Une série de rencontres vidéo entre DHH, Kent Beck et Martin Fowler ont cristallisé ces débats.\n\nAprès un bref résumé des arguments avancés par les uns et les autres, nous allons montrer par du code pourquoi le TDD reste une technique majeure pour développer.\n\nOn va prendre l’exemple de code de DHH (en java8 et fluenthttp) et montrer comment on peut éviter d’arriver à l’horreur qu’il a montré tout en étant dirigé par les tests."
                            }
                        ]
                    },
                    {
                        "type":"agile",
                        "talks":[
                            {"id":32,
                                "format":"conference",
                                "url":"",
                                "title":"Initiation à Kanban",
                                "description":"La méthode Kanban a été déployée dans les années 50, par Toyota, dans le but de réguler le flux de travail de l’amont à l’aval d’une chaine de production kanban a ensuite été adapté à l’IT par David Anderson.\n\nAujourd’hui, la méthode Kanban pour l’IT fait partie des méthodes Agile et des pratiques Lean, avec pour objectif d’offrir aux équipes une approche évolutive cadrée autour de 4 piliers et 6 pratiques.\n\nDans cette session, je vous propose une initiation à la méthode kanban adaptée au monde de l’IT et son apport dans l’amélioration continue des équipes projets voulant passer à l’agilité ou souhaitant améliorer son processus Scrum. Cette session sera aussi l’occasion de présenter les apports de kanban sur la prédictibilité des activités."
                            }
                        ]
                    },
                    {
                        "type":"java",
                        "talks":[
                            {"id":51 , 
                            "format":"conference", 
                            "url":"", 
                            "title":"50 nouvelles choses que l'on peut faire avec Java 8",
                            "description":"Java 8, c'est bien sûr l'arrivée des lambdas, des Stream et des Collectors. Mais ce n'est pas que cela. Plein de nouvelles choses sont aussi offertes : un nouvelle API pour les dates, un nouveau moteur Javascript, une nouvelle version de JavaFX, une nouvelle ConcurrentHashMap, une nouvelle HashMap, des nouveautés dans le domaine de la concurrence, et toutes sortes de petites choses qui vont nous faciliter la vie, que l'on se propose de passer en revue ici."
                            }
                         ]
                    },
                    {
                        "type":"java",
                        "talks":[
                            {"id":52 , 
                            "format":"conference", 
                            "url":"", 
                            "title": "Scala, pourquoi et pourquoi pas?",
                            "description": "Tantôt merveilleux, tantôt cauchemardesque, Scala est un langage qui ne laisse pas indifférent.\n\nPourquoi toi développeur Java, tu devrais jeter un œil sur Groovy, Scala ou Haskell? Pour découvrir de nouvelles façon de résoudre tes problèmes de tous les jours.\n\nJe vous propose un tour d'horizon des possibilités du langage. Avec du code, du code et du code... et un peu de temps de compilation aussi!"
                            }
                         ]
                    },
                    {
                        "type":"java",
                        "talks":[
                            {"id":53 , 
                            "format":"quickie", 
                            "url":"", 
                            "title": "Le pourquoi du comment du type Option",
                            "description": "Lorsque l'on découvre le monde de la programmation fonctionnelle, on est absorbé par une multitude de nouveaux concepts. Dans la masse, un concept a retenu mon attention : le type Option. \nCe type est disponible dans plusieurs langages comme Java (pas seulement la version 8), Scala, Groovy, Haskell, Ocaml, etc.\n\nSous la forme d'un live coding basé sur le langage Java, je vous propose de répondre à ces 2 questions : pourquoi et comment l'utiliser ?"
                            }
                         ]
                    },
                    {
                        "type":"java",
                        "talks":[
                            {"id":54 , 
                            "format":"conference", 
                            "url":"", 
                            "title": "JHipster, un générateur Yeoman pour les développeurs Java",
                            "description": "JHipster est un générateur Yeoman permettant de créer une application Maven + Spring Boot + AngularJS.\nDepuis sa création en Novembre 2013, le projet a connu une popularité très importante : + de 800 étoiles Github, 49 contributeurs, + de 100 000 pages vues par mois. C'est le 2ème générateur Yeoman \"communautaire\" le plus populaire, et le générateur d'applications Spring le plus populaire.\nCette présentation couvrira les technologies utilisées par JHipster (Spring Boot, AngularJS, Bower, Grunt, etc...), ainsi qu'une session de \"live coding\"."
                           }
                         ]
                    },
                    {
                        "type":"java",
                        "talks":[
                            {"id":56 ,
                                "format":"conference",
                                "url":"",
                                "title": "Keep it Simple, Stupid, my a** !",
                                "description": "Un des mantra qui circule dans le monde du développeur est KISS : Keep it simple, stupid !\nIl s'agit d'exiger des développeurs qu'ils conçoivent des architectures simples, qui seront plus faciles à maintenir.\nComme beaucoup de principes qui circulent chez les consultants en organisation, il s'agit plus d'un souhait marketing qu'une réalité tangible.\nCette présentation va tenter d'expliquer \"simplement\" pourquoi ce n'est pas si facile d'embrasser la simplicité !"
                            }
                        ]
                    },
                    {
                        "type":"java",
                        "talks":[
                            {"id":57 ,
                                "format":"conference",
                                "url":"",
                                "title": "Les Applications Réactives : un nouveau paradigme pour relever les défis de l'économie numérique",
                                "description": "A quels enjeux est confrontée une entreprise qui souhaite développer sa stratégie digitale ? Pourquoi les paradigmes de développement classiques ne sont pas adaptés pour développer les applications du futur ? Nous montrerons tout d'abord pourquoi au delà du buzz marketing, les Applications Réactives apportent une réponse aux défis que doivent relever les organisations. Nous décrirons ensuite les principes réactifs et en illustrerons la mise en oeuvre avec différentes implémentations actuellement disponibles."
                            }
                        ]
                    },
                    {
                        "type":"java",
                        "talks":[
                            {"id":58 ,
                                "format":"quickie",
                                "url":"",
                                "title": "L'analyse de code au service de la qualité",
                                "description": "La qualité du code est au coeur des discussions entre développeurs et est aujourd'hui une demande forte de la part des décideurs et des clients en France.\nQue représente la \"qualité\" aujourd'hui ? Quels sont les enjeux pour les équipes ?\nQuelles sont les approches autour de l'analyse de code pour améliorer cette qualité ?\nSont abordés : \n - Le pair programming\n - L'analyse statique\n - La revue de code\n - L'audit de code\nLa session passe en revue les avantages et points d'attention de chaque approche, ainsi que les outils couramment utilisés.\nLe tout se basera également sur un retour d'expérience (équipe de 15 devs Java) avec un focus sur la piste que nous avons privilégiée : Phabricator (audit de code)"
                            }
                        ]
                    },
                    {
                        "type":"innovation",
                        "talks":[
                            {"id":101 ,  
                            "format":"conference", 
                            "url":"", 
                            "title":"La révolution Docker",
                             "description":"En très peu de temps, Docker a su s'imposer comme un standard de facto dans le monde du Cloud, ne laissant aucun fournisseur impassible. A mi-chemin entre IaaS et PaaS, Docker brouille les cartes et ouvre de nouvelles opportunités. Au cours de ce talk, nous vous présenterons ce qu'est techniquement Docker, son impact sur l'écosystème et comment vous pouvez le mettre à profit pour vos propres développements."
                             }
                         ]
                    },
                    {
                        "type":"innovation",
                        "talks":[
                            {"id":102 ,  
                            "format":"conference", 
                            "url":"", 
                            "title":"Introduction aux Google Glass",
                             "description":"Les Google Glass, tout le monde en parle. Mais peu les ont vraiment testées ou ont développé dessus. Cette conférence est une introduction sur les Google Glass et couvrira ce que sont les Glass, comment elles fonctionnent et ce qu'on peut déjà faire avec. On parlera ensuite de développement via la Mirror API et le GDK Sneak Peek, pour finir par un retour d'expérience en tant que Glass Explorer et développeur depuis presque un an. La présentation sera accompagnée de démos."
                             }
                         ]
                    },
                    {
                        "type":"innovation",
                        "talks":[
                            {"id":103 ,  
                            "format":"conference", 
                            "url":"", 
                            "title":"Tour d'horizon du machine learning",
                            "description":"La maturité actuelle des technologies issues de la science des données (data science) permet d'envisager l'utilisation massive des données disponibles pour en tirer un avantage concurrentiel déterminant. Encore faut-il  en maitriser des technologies sous-jacentes. Cette présentation vise à offrir un point de vue sur le sujet en abordant les principaux algorithmes le l'apprentissage statistique (SVM, deep learning...) et outils logiciels permettant leur mise en œuvre. La présentation se fera à partir de cas précis comme ceux de la recommandation ou reconnaissance de formes"
                             }
                         ]
                    },
                     {
                        "type":"innovation",
                        "talks":[
                            {"id":104 ,  
                            "format":"conference", 
                            "url":"", 
                            "title":"From Dev to Maker",
                            "description": "Dans tout développeur il y a un maker.\nLes objets connectés sont facile à faire et demandent très peu de compétences particulières. Tout développeur peut se lancer dans le Arduino, le BLE, le Raspberry Pi !"
                             }
                         ]
                    },
                     {
                        "type":"innovation",
                        "talks":[
                            {"id":105 ,  
                            "format":"conference", 
                            "url":"", 
                            "title": "Spark, où comment traiter des données à la vitesse de l’éclair",
                            "description": "Spark fait partie de la nouvelle génération de frameworks de manipulation de données basés sur Hadoop. L’outil utilise agressivement la mémoire pour offrir des temps de traitement jusqu’à 100 fois plus rapides.\n\nDans cette session, nous découvrirons les principes de traitement de données (notamment MapReduce) et nous analyserons les options mises à disposition pour monter un cluster (HDFS, Tachyon, Yarn…). Une démonstration sera faite pour mettre en évidence les capacités du framework. Enfin, un point sera fait sur Spark Streaming pour le traitement de données en flux continu."
                            }
                         ]
                    },
                    {
                        "type":"innovation",
                        "talks":[
                            {"id":106 ,  
                            "format":"quickie", 
                            "url":"", 
                            "title": "Comment effectuer des tests d'intégrations sur vos applications mobiles ?",
                            "description": "Venez découvrir comment sont effectués les tests d'intégrations sur les deux applications mobiles (iOS et Android) qui figurent constamment dans le top 20 de leur store respectif !\n\nRetour d'expérience sur la création d'un \"Mobile Test Lab\""
                            }
                         ]
                    },
                    {
                        "type":"innovation",
                        "talks":[
                            {"id":107 ,  
                            "format":"quickie", 
                            "url":"", 
                            "title": "De l’impératif au fonctionnel, retour d’expérience avec Haskell",
                            "description": "L’informatique est dominée par la programmation impérative et ses dérivées. Pourtant, d’autres paradigmes ont été développés qui permettent de s’affranchir des contraintes de la programmation impérative. Parmi ceux-ci, on trouve la programmation fonctionnelle. Cette session présente un retour d’expérience de développement avec Haskell, un langage fonctionnel pur."
                            }
                        ]
                    }
                ]
            }
        ]
    }
}

